*** evaluate
Compute the mean and standard deviation of the RMSE for 2-fold and 10-fold
#+BEGIN_SRC R :session :results output :exports both
  cat(sprintf("2-fold cv rmse mean = %f\n", mean(rmse_2)))
  cat(sprintf("2-fold cv rmse sd = %f\n", sd(rmse_2)))
  cat(sprintf("10-fold cv rmse mean = %f\n", mean(rmse_10)))
  cat(sprintf("10-fold cv rmse sd = %f\n", sd(rmse_10)))
#+END_SRC

#+RESULTS:
: 2-fold cv rmse mean = 1.140355
: 2-fold cv rmse sd = 0.018834
: 10-fold cv rmse mean = 1.122786
: 10-fold cv rmse sd = 0.004429

